{
  "personalInfo": {
    "name": "Mateen Shahzad",
    "phone": "+92-320-6869576",
    "email": "mateenshahzad777@gmail.com",
    "linkedin": "https://linkedin.com/in/mateenshahzad",
    "github": "https://github.com/codebymateen",
    "location": "Lahore, Pakistan",
    "role": "Software Engineer"
  },
  "fontFamily": "Calibri",
  "fontSize": 14,
  "navbarFontSize": 11,
  "selectedColor": {
    "primary": "#4a90e2",
    "secondary": "#2c5aa0",
    "name": "Light Blue"
  },
  "about": "A dedicated Software Engineer skilled in JavaScript, TypeScript and Python. Experienced in building backend solutions using modern frameworks with a focus on developing Backend and AI solutions and solving R&D challenges. A self-motivated, quick learner, adept at collaboration and delivering high-quality projects on time.",
  "workExperience": [
    {
      "id": "1",
      "company": "Musketeers Tech",
      "position": "Software Engineer",
      "duration": "Dec 2024 - Present",
      "location": "Lahore, Pakistan",
      "responsibilities": [
        "Developed an algorithm Bug Tracker that removed duplicate entry of records, resolved data inconsistencies and prevented app crashes resulting in improved data integrity and optimized sorting and filtering of records.",
        "Implemented a Custom Chatbot using FastAPI + LangChain + GPT-4 with integrated Prompt Engineering for accurate natural language understanding. The bot is capable of handling voice input, multilingual translation, command-based actions (e.g. create room, fetch user groups) and generating intelligent, dynamic replies.",
        "Deployed a Generative AI project that creates realistic video advertisements and promotions of products using custom AI avatars and voice synthesis, capable of doing product promotions from any script that enhances user engagement and automating ad content creation for personal brands and commercial products."
      ]
    },
    {
      "id": "2",
      "company": "Planlab Solutions",
      "position": "Software Engineer",
      "duration": "Aug 2024 - Dec 2024",
      "location": "Lahore, Pakistan",
      "responsibilities": [
        "Developed and documented RESTful APIs of Realwealtdy (Real Estate Application) for property listings, property units details, user and tenant management, financial tracking and media handling using NestJS, PostgreSQL and Prisma ORM.",
        "Integrated AWS S3 media storage and Middesk API for business verification and smooth Builder onboarding.",
        "Designed API documentation with Swagger, following clean code principles and best API writing and Database Query writing practices.",
        "Collaborated with frontend and QA teams, ensuring smooth project execution and timely sprints delivery in an Agile environment."
      ]
    },
    {
      "id": "3",
      "company": "Educist Testing Services",
      "position": "Software Engineer",
      "duration": "Feb 2023 - Aug 2024",
      "location": "Lahore, Pakistan",
      "responsibilities": [
        "Designed a comprehensive business monitoring and CRM system Timelapse analytics to track company growth, sales performance and client activity patterns, enabling executives to identify peak sales periods, most profitable products and customer behavior trends for improved business decision-making.",
        "Developed and optimized EdTest (SAAS online exam preparation platform) backend using Node.js, Express and MongoDB, handling diverse question types and difficulty levels.",
        "Implemented payment integrations using Stripe, JazzCash, Handle bulk data upload and media storage with Cloudinary.",
        "Enabled dynamic test creation with advanced filtering and ensured optimum API performance through testing and clean architecture.",
        "Collaborated in an Agile team, use Git for version control and participate in daily Scrum meetings."
      ]
    },
    {
      "id": "4",
      "company": "Mslm",
      "position": "Software Engineer Intern",
      "duration": "Jun 2023 - Aug 2023",
      "location": "Lahore, Pakistan",
      "responsibilities": [
        "Developed and optimized RESTful APIs with Go and PostgreSQL, ensuring secure access control, payment integration via Stripe and automated email send functionality.",
        "Handled database transactions, indexing, migrations and integrated AWS S3 for media storage.",
        "Conducted API testing, resolved bugs and used Git for version control and GitHub for collaboration with cross-functional teams."
      ]
    },
    {
      "id": "5",
      "company": "Tkxel",
      "position": "Software Engineer Intern",
      "duration": "Jul 2022 - Aug 2022",
      "location": "Lahore, Pakistan",
      "responsibilities": [
        "Worked on backend development tasks using Python Django and FastAPI with Django ORM and MySQL database.",
        "Developed RESTful APIs and gained hands-on experience with modern development practices.",
        "Collaborated with development teams and learned industry-standard coding practices.",
        "Participated in code reviews and contributed to project documentation."
      ]
    }
  ],
  "projects": [],
  "skills": [
    {
      "id": "1",
      "name": "Languages & Technologies",
      "skills": [
        "Languages: JavaScript, TypeScript, Python",
        "Backend: Node.js, Express.js, Next.js, Nest.js, Fastify, Django, FastAPI",
        "Databases: MySQL, PostgreSQL, MongoDB, MS SQL, Prisma (ORM)",
        "Cloud & DevOps: AWS (S3, RDS), Docker, Firebase, Redis",
        "Other: Git & GitHub, Swagger, SQL Injection Handling"
      ]
    },
    {
      "id": "2",
      "name": "Development Expertise",
      "skills": [
        "Backend Engineering: API development (RESTful), Microservices Architecture, SDLC, Agile/Scrum, 3rd Party API Integrations",
        "Clean Code Practices (SOLID, Design patterns, Loosely coupled architecture)",
        "Software Re-Engineering (refactoring techniques for legacy code)",
        "Database & Schema Design: Schema building, ERD (Entity-Relationship Diagram) creation, relational diagrams",
        "Software Quality Assurance: Unit Testing, Integration Testing, Postman, API performance optimization"
      ]
    },
    {
      "id": "3",
      "name": "Additional Skills",
      "skills": [
        "Problem-solving, Analytical thinking, Communication & teamwork, Quick learner, Time management"
      ]
    }
  ],
  "education": {
    "institution": "University of Management & Technology, Lahore",
    "degree": "Bachelor of Science, Computer Software Engineering",
    "duration": "July 2020 - June 2024",
    "grade": "Grade: A"
  },
  "achievements": []
}