{
    "personalInfo": {
        "name": "Mateen Shahzad",
        "phone": "+92-320-6869576",
        "email": "mateenshahzad777@gmail.com",
        "linkedin": "https://linkedin.com/in/mateenshahzad",
        "github": "https://github.com/codebymateen",
        "location": "Lahore, Pakistan",
        "role": "Software Engineer"
    },
    "fontFamily": "Calibri",
    "fontSize": 14,
    "navbarFontSize": 11,
    "selectedColor": {
        "primary": "#4a90e2",
        "secondary": "#2c5aa0",
        "name": "Light Blue"
    },
    "workExperience": [
        {
            "id": "1",
            "company": "Musketeers Tech",
            "position": "Software Engineer",
            "duration": "Dec 2024 - Present · 8 mos",
            "location": "On-site",
            "responsibilities": [
                "Developed an algorithm Bug Tracker that removed duplicate entry of records, resolved data inconsistencies, and prevented app crashes resulting in improved data integrity and optimized sorting and filtering of records.",
                "Implemented a Custom Chatbot using FastAPI + LangChain + GPT-4 with integrated Prompt Engineering for accurate natural language understanding. The bot is capable of handling voice input, multilingual translation, command-based actions (e.g. create room, fetch user groups) and generating intelligent, dynamic replies.",
                "Deployed a Generative AI project that creates realistic video advertisements and promotions of products using custom AI avatars and voice synthesis, capable of doing product promotions from any script that enhances user engagement and automating ad content creation for personal brands and commercial products."
            ]
        },
        {
            "id": "2",
            "company": "Planlab Solutions",
            "position": "Software Engineer",
            "duration": "Aug 2024 - Dec 2024",
            "location": "Lahore, Pakistan",
            "responsibilities": [
                "Built and developed core backend of real estate management system handling property units, tenant management, and financial tracking with RESTful APIs.",
                "Engineered a high-performance gambling application backend with real-time transaction processing, secure payment gateways, and advanced risk management algorithms ensuring 99.9% uptime and regulatory compliance.",
                "Built a decentralized NFT marketplace using Node.js and Web3 technologies, implementing smart contracts for token minting, trading mechanisms, and cross-chain interoperability, achieving 500+ daily active users within 3 months."
            ]
        },
        {
            "id": "3",
            "company": "Educist Testing Services",
            "position": "Software Engineer",
            "duration": "Feb 2023 - Aug 2024",
            "location": "Lahore, Pakistan",
            "responsibilities": [
                "Designed a comprehensive business monitoring and CRM system Timelapse analytics to track company growth, sales performance, and client activity patterns, enabling executives to identify peak sales periods, most profitable products, and customer behavior trends for improved business decision-making."
            ]
        }
    ],
    "projects": [
        {
            "id": "1",
            "name": "API Rate Limiting Gateway",
            "githubLink": "Github Link",
            "description": [
                "Built a lightweight API gateway with token bucket rate-limiting per user and per API, capable of handling 1M+ requests per day with minimal latency overhead.",
                "Implemented distributed caching with Redis for session management and rate limit tracking across multiple gateway instances.",
                "Designed comprehensive monitoring dashboard with real-time traffic analytics and alerting for rate limit violations."
            ],
            "technologies": ["Java", "Spring Boot", "Redis", "MongoDB", "Docker"]
        },
        {
            "id": "2",
            "name": "Cloud Cost Analyzer Tool",
            "githubLink": "Github Link",
            "description": [
                "Created a full-stack internal tool for real-time cost monitoring across AWS services, visualizing daily/monthly spend and forecasting based on usage trends.",
                "Developed automated cost optimization recommendations based on usage patterns and resource utilization analysis.",
                "Built interactive data visualization components with filtering and drill-down capabilities for detailed cost breakdown."
            ],
            "technologies": ["React", "Node.js", "AWS SDK", "Chart.js", "PostgreSQL"]
        },
        {
            "id": "3",
            "name": "Timelapse",
            "githubLink": "Github Link",
            "description": [
                "Developed a comprehensive business monitoring and CRM system Timelapse analytics to track company growth, sales performance, and client activity patterns in real-time.",
                "Implemented intelligent data visualization algorithms to identify peak sales periods, most profitable products, and client behavior trends, resulting in 35% improved business decision-making.",
                "Built an automated reporting dashboard with AWS Lambda and React, providing executives with actionable insights on revenue optimization, inventory management, and customer engagement metrics."
            ],
            "technologies": ["Python", "React", "AWS Lambda", "Chart.js", "PostgreSQL"]
        }
    ],
    "skills": [
        {
            "id": "1",
            "name": "Programming Languages",
            "skills": ["Python", "JavaScript", "TypeScript"]
        },
        {
            "id": "2",
            "name": "Frameworks",
            "skills": ["Node.js", "Express.js", "Nest.js", "Next.js", "Fastify", "Django", "FastAPI"]
        },
        {
            "id": "3",
            "name": "System Design",
            "skills": ["Microservices Architecture", "Domain-Driven Design (DDD)", "Event-Driven Systems", "Design Patterns", "Blockchain Architecture"]
        },
        {
            "id": "4",
            "name": "Cloud and DevOps",
            "skills": ["Kubernetes", "Amazon Web Services", "Terraform", "Github", "Jenkins"]
        },
        {
            "id": "5",
            "name": "Data & Databases",
            "skills": ["MySQL", "DynamoDB", "MongoDB", "Kafka", "IPFS"]
        }
    ],
    "education": {
        "institution": "University of Management & Technology, Lahore",
        "degree": "Bachelor of Science, Computer Software Engineering",
        "duration": "July 2020 - June 2024",
        "grade": "Grade: 3.2"
    },
    "achievements": [
        "Recognized as a Top Contributor in team-level hackathons and internal code quality initiatives at Planlab Solutions.",
        "Recognized for delivering a mini project on internship/training, including REST API development, database integration, and unit testing.",
        "Presented a technical talk on scalable microservices architecture at an internal engineering conference attended by 200+ engineers."
    ]
} 